app/Models/NewsModel.php

SELECT COUNT(*) AS `numrows`
FROM `news`
SELECT `id`, `title`, `body`, `published_at`
FROM `news`
 LIMIT 5
---
    public function getAllPaged($nElements, $order, $sort_order) {

        if ($order == "")
            return $this->select(['id', 'title', 'body', 'published_at'])->paginate($nElements);